---
type: IFCTransaction
namespace: Autodesk.Revit.DB.IFC
version: 2024
members: 5
tags: [revit-api, class]
---

# IFCTransaction

`Autodesk.Revit.DB.IFC.IFCTransaction` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | IFCTransaction | 2012 | `public IFCTransaction ( IFCFile file )` |
| Method | Commit | 2012 | `public void Commit ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | RollBack | 2012 | `public void RollBack ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |